In [1]:
import pyodbc
import time
import numpy as pd
import pandas as pd
# %python3 -m pip install pyautogui
# %python3 -m pip install tensorflow
# %python3 -m pip install selenium

In [2]:
from arcgis.gis import GIS

In [3]:
cnxn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER=DESKTOP-GRJ2O6R;DATABASE=AdventureWorksDW2019;Trusted_Connection=Yes;')

In [4]:
df = pd.read_sql("SELECT * FROM Report_InternetSales", cnxn)
df.head()

,CurrencyKey,OrderQuantity,SalesAmount,TaxAmt,TotalProductCost,FirstName,MiddleName,LastName,EnglishProductName,ProductKey,City,StateProvinceName,GeographyKey,CustomerKey
0,100,1,699.0982,55.9279,413.1463,Ruben,None,Prasad,"Road-650 Black, 62",336,Beverly Hills,California,300,14501
1,100,1,3578.2700,286.2616,2171.2942,Colin,G,Anand,"Road-150 Red, 44",311,Coronado,California,312,27645
2,100,1,3578.2700,286.2616,2171.2942,Kevin,None,Gonzalez,"Road-150 Red, 44",311,Kirkland,Washington,623,27668
3,100,1,3578.2700,286.2616,2171.2942,Jeremiah,D,Martinez,"Road-150 Red, 62",310,Ballard,Washington,607,27671
4,100,1,3578.2700,286.2616,2171.2942,Alexandria,W,Hughes,"Road-150 Red, 52",313,Lake Oswego,Oregon,542,27625